
Функция ДобавитьКДате(ДатаНачала, КоличествоПериодов, ТипПериода) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(&ДатаНачала, ТипПериода, КоличествоПериодов) КАК НоваяДата";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТипПериода", ТипПериода);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КоличествоПериодов", КоличествоПериодов);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.НоваяДата;
	
КонецФункции

Функция РазностьДат(ДатаНачала, ДатаОкончания, ТипПериода) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РазностьДат(&ДатаНачала, &ДатаОкончания, ТипПериода) КАК РазностьДат";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТипПериода", ТипПериода);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.РазностьДат;
	
КонецФункции

Функция ПолучитьИспользуемуюДату() Экспорт
	
	Если Константы.РежимТестирования.Получить() Тогда
		Возврат Константы.ДатаТестирования.Получить();
	Иначе
		Возврат ТекущаяДата();
	КонецЕсли;
	
КонецФункции
