
Функция ДобавитьКДате(ДатаНачала, КоличествоПериодов, ТипПериода) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(&ДатаНачала, ТипПериода, КоличествоПериодов) КАК НоваяДата";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТипПериода", ТипПериода);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КоличествоПериодов", КоличествоПериодов);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.НоваяДата;
	
КонецФункции