
#Область ПрограммныйИнтерфейс

Процедура ОткрытьФормуСпискаПланируемыхРасходов() Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВидРасхода", ПредопределенноеЗначение("Перечисление.ВидыРасходов.Планируемый"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОтборПоДате", Истина);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("Документ.РасходДенежныхСредств.Форма.ФормаСписка", ПараметрыФормы,,"Планируемый");
	
КонецПроцедуры

Процедура ОткрытьФормуСпискаФактическихРасходов() Экспорт
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВидРасхода", ПредопределенноеЗначение("Перечисление.ВидыРасходов.Фактический"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОтборПоДате", Истина);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("Документ.РасходДенежныхСредств.Форма.ФормаСписка", ПараметрыФормы,,"Фактический");
	
КонецПроцедуры

Процедура ОткрытьФормуВыбораДаты(Форма) Экспорт
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОкончаниеВыбораДаты", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Дата", Форма.Объект.Дата);
	
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораДаты", ПараметрыФормы,,,,, ОповещениеОЗакрытии);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура ОкончаниеВыбораДаты(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		ДополнительныеПараметры.Форма.Объект.Дата = РезультатЗакрытия;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти