
#Если МобильноеПриложениеКлиент Тогда
	
&НаКлиенте
Процедура КупитьПодписку(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработчикЗавершенияПокупкиПодписки", ЭтотОбъект);
	
	ВстроенныеПокупки.НачатьПриобретение(ОписаниеОповещения,
		РаботаСоВстроеннымиПокупкамиКлиент.ИдентфикаторГлавнойПодписки());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗавершенияПокупкиПодписки(Покупка, Успешно, Квитанция, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

#КонецЕсли


