
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФактическийОстатокЛимита = Параметры.ФактическийОстатокЛимита;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РедактироватьФактическийОстатокЛимита(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФактическийОстатокЛимита", ФактическийОстатокЛимита);
	
	ОткрытьФорму("РегистрСведений.ОстатокЛимитаДенежныхСредств.Форма.ФормаРедактированияЛимита", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЛимитНаПериод(Команда)
	
	ОткрытьФорму("РегистрСведений.ЛимитДенежныхСредств.Форма.ФормаУстановкиЛимитаНаПериод", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеДанные(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьВсеДанныеЗавершение", ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения, 
		НСтр("ru = 'Будут удалены все данные приложения. Продолжить?'"), 
		РежимДиалогаВопрос.ДаНет, 
		60,
		КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанные(Команда)
	
	Файл = Новый Файл("C:\Users\Maksim\Desktop\Тест пройден.txt");
	РазмерФайла = 10; //Файл.Размер();
	
	ДвоичныеДанные = Новый ДвоичныеДанные("C:\Users\Maksim\Desktop\Тест пройден.txt");
	
	ВыгрузитьДанныеСервер(РазмерФайла, ДвоичныеДанные);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура УдалитьВсеДанныеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		УдалитьВсеДанныеСервер();
		Оповестить("ИзменениеОстатков");
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьВсеДанныеСервер()

	// Документы
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходДенежныхСредств.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПриходДенежныхСредств КАК ПриходДенежныхСредств
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РасходДенежныхСредств.Ссылка
		|ИЗ
		|	Документ.РасходДенежныхСредств КАК РасходДенежныхСредств";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДокумент = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДокумент.Следующий() Цикл
		ДокОбъект = ВыборкаДокумент.Ссылка.ПолучитьОбъект();
		ДокОбъект.Удалить();
	КонецЦикла;
	
	// Константы
	Константы.ПоследняяДатаРасчетаФактическогоОстаткаЛимита.Установить(Дата("00010101"));
	
	// РегистрыСведений
	НаборЗаписей = РегистрыСведений.ЛимитДенежныхСредств.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
	НаборЗаписей = РегистрыСведений.ОстатокЛимитаДенежныхСредств.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыгрузитьДанныеСервер(РазмерФайла, ДвоичныеДанные)
	
	//ssl = Новый ЗащищенноеСоединениеOpenSSL();
	//			
	//СоединениеHTTP = Новый HTTPСоединение("https://www.googleapis.com/drive/v2",,,,,,ssl);
	//
	//ЗапросHTTP = Новый HTTPЗапрос("/files/d/1VrKm_lUybxxfxIrUsPcrxS8LX_yhTT39/view?usp=sharing");
	//
	//Ответ = СоединениеHTTP.Получить(ЗапросHTTP);
	
	//https://yadi.sk/d/PJGUwdXn5xKIwg
	
	SSL = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);
	
	
	//СоединениеHTTP = Новый HTTPСоединение("yandex.ru",,,,,,SSL);
	СоединениеHTTP = Новый HTTPСоединение("webdav.yandex.ru",443,,,,,SSL);
	//СоединениеHTTP = Новый HTTPСоединение("yadi.sk",,,,,,SSL);
	
	Заголовки = Новый Соответствие;
	//Заголовки.Вставить("Content-Charset", "utf-8");		
	//Заголовки.Вставить("Accept", "*/*");
	
	ЗапросHTTP = Новый HTTPЗапрос;
	ЗапросHTTP.АдресРесурса = "/d/PJGUwdXn5xKIwg";
	ЗапросHTTP.Заголовки = Заголовки;
	
	//ХешДанныхMD5 = Новый ХешированиеДанных(ХешФункция.MD5);
	//ХешДанныхMD5.Добавить(ДвоичныеДанные);
	//
	//ХешДанныхSHA256 = Новый ХешированиеДанных(ХешФункция.SHA256);
	//ХешДанныхSHA256.Добавить(ДвоичныеДанные);
	
	Ответ = СоединениеHTTP.ВызватьHTTPМетод("PUT", ЗапросHTTP);
	
	Сообщить(Ответ.КодСостояния);
	///d/PJGUwdXn5xKIwg/Тест пройден.txt HTTP/1.1 
	//	|Etag: " + ХешДанныхMD5.ХешСумма + "
	//	|Sha256: " + ХешДанныхSHA256.ХешСумма + "
	//	|Expect: 100-continue
	//	|Content-Type: text
	//	|Content-Length:" + РазмерФайла + "
	//	|
	//	|"+ ДвоичныеДанные, ЗапросHTTP);
	
КонецПроцедуры

#КонецОбласти