
&НаКлиенте
Процедура ПолучитьРазностьДат(Команда)
	ПолучитьРазностьДатНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьРазностьДатНаСервере()
	
	РазностьДат = ОбщегоНазначенияСервер.РазностьДат(ДатаНачала, КонецДня(ДатаОкончания), "ДЕНЬ");
	
	Сообщить(РазностьДат);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКонстанту(Команда)
	ОчиститьКонстантуНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьКонстантуНаСервере()
	
	Константы.ПоследняяДатаРасчетаФактическогоОстаткаЛимита.Установить(Неопределено);
	
КонецПроцедуры
