
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ИзмененОстатокДенежныхСредств");
	Оповестить("ИзмененОстатокЛимитаДенежныхСредств");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодтвердитьФактическийРасход(Команда)
	
	Объект.ВидРасхода = ПредопределенноеЗначение("Перечисление.ВидыРасходов.Фактический");
	Записать();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура УправлениеФормой()
	
	Элементы.ПодтвердитьФактическийРасход.Видимость = Объект.ВидРасхода = Перечисления.ВидыРасходов.Планируемый;
	
КонецПроцедуры

#КонецОбласти