
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НовыйОстатокЛимита = Параметры.ТекущийОстатокЛимита;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЗаписатьИЗакрытьНаСервере(НовыйОстатокЛимита);
	Оповестить("ИзменениеОстатков");
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервереБезКонтекста
Процедура ЗаписатьИЗакрытьНаСервере(НовыйОстатокЛимита)
	
	МенеджерЗаписи = РегистрыСведений.ОстатокЛимитаДенежныхСредств.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Сумма = НовыйОстатокЛимита;
	Если НовыйОстатокЛимита = 0 Тогда
		МенеджерЗаписи.Удалить();
	Иначе
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

