
#Область ОбработчикиСобытийОбъекта

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ДенежныеСредства.Записывать = Истина;
	
	Движение = Движения.ДенежныеСредства.ДобавитьПриход();
	Движение.Период = Дата;
	Движение.Сумма = Сумма;	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

Функция РассчитатьНовыйЛимитДенежныхСредств()
	
	ТекущийОстатокЛимита = УчетДенежныхСредствСервер.ПолучитьОстатокЛимитаДенежныхСредств();
	ЛимитДенежныхСредств = УчетДенежныхСредствСервер.ПолучитьЛимит();
	РасходыЗаТекущийПериод = УчетДенежныхСредствСервер.ПолучитьРасходыЗаТекущийПериод();
	
	ОсталосьОтЛимита = ЛимитДенежныхСредств - (ТекущийОстатокЛимита - РасходыЗаТекущийПериод);
	
	СуммаДляРаспределения = Мин(ОсталосьОтЛимита, Сумма);
	
КонецФункции

#КонецОбласти
