
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПересчитатьОстатки();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ИзменениеОстатков" Тогда
		ПересчитатьОстатки();
	ИначеЕсли ИмяСобытия = "ИзменениеЛимитаНаПериод" Тогда
		ПересчитатьОстаткиПриИзмененииЛимита();
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ФактическийОстатокЛимитаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	УчетДенежныхСредствКлиент.ОткрытьФормуСпискаФактическихРасходов();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПлановыйОстатокЛимитаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	УчетДенежныхСредствКлиент.ОткрытьФормуСпискаПланируемыхРасходов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьТекущийОстатокДенежныхСредств(Команда)

	ПересчитатьОстатки();	

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПриход(Команда)
	
	ОткрытьФорму("Документ.ПриходДенежныхСредств.Форма.ФормаДокумента");
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРасход(Команда)
	
	ОткрытьФорму("Документ.РасходДенежныхСредств.Форма.ФормаДокумента");
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПланируемыйРасход(Команда)
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ВидРасхода", ПредопределенноеЗначение("Перечисление.ВидыРасходов.Планируемый"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.РасходДенежныхСредств.Форма.ФормаДокумента", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ФактическийОстатокЛимита", ФактическийОстатокЛимита);
	
	ОткрытьФорму("ОбщаяФорма.ФормаНастроек", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ПересчитатьОстатки()
	
	ТекущийОстатокДенежныхСредств = УчетДенежныхСредствСервер.ПолучитьОстатокДенежныхСредств();
	ФактическийОстатокЛимита = УчетДенежныхСредствСервер.РассчитатьФактическийОстатокЛимитаДенежныхСредствНаПериод();
	ПланируемыеРасходы = УчетДенежныхСредствСервер.ПолучитьПланируемыеРасходаЗаПериод();

	ПлановыйОстатокЛимита = ФактическийОстатокЛимита - ПланируемыеРасходы;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьОстаткиПриИзмененииЛимита()
	
	ФактическийОстатокЛимита = УчетДенежныхСредствСервер.ПолучитьОстатокЛимитаПриИзмененииЛимитаНаПериод();
	ПланируемыеРасходы = УчетДенежныхСредствСервер.ПолучитьПланируемыеРасходаЗаПериод();

	ПлановыйОстатокЛимита = ФактическийОстатокЛимита - ПланируемыеРасходы;
	
КонецПроцедуры

#КонецОбласти

