
Процедура УдалитьВсеПовторяющиеСобытияПоДанномуОснованию(УИДПовторяемыхСобытий, ДокументИсключения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходДенежныхСредств.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РасходДенежныхСредств КАК РасходДенежныхСредств
		|ГДЕ
		|	РасходДенежныхСредств.УИДПовторяемыхСобытий = &УИДПовторяемыхСобытий
		|	И РасходДенежныхСредств.Ссылка <> &Ссылка
		|	И РасходДенежныхСредств.ВидРасхода = &ВидРасхода";
	
	Запрос.УстановитьПараметр("ВидРасхода", Перечисления.ВидыРасходов.Планируемый);
	Запрос.УстановитьПараметр("Ссылка", ДокументИсключения);
	Запрос.УстановитьПараметр("УИДПовторяемыхСобытий", УИДПовторяемыхСобытий);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДокумент = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДокумент.Следующий() Цикл
		ДокОбъект = ВыборкаДокумент.Ссылка.ПолучитьОбъект();
		ДокОбъект.Удалить();
	КонецЦикла;
	
КонецПроцедуры