
#Область ОбработчикиСобытийОбъекта

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Если ВидРасхода = Перечисления.ВидыРасходов.Фактический Тогда
		
		СформироватьДвиженияПоРегиструДенежныеСредства();
		УчетДенежныхСредствСервер.СформироватьРасходПоРегиструОстатокЛимитаДенежныхСредств(Сумма);
	
	ИначеЕсли ВидРасхода = Перечисления.ВидыРасходов.Планируемый Тогда
		
		СформироватьДвиженияПоРегиструПланируемыеОстаткиДенежныхСредств();
		
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

Процедура СформироватьДвиженияПоРегиструДенежныеСредства()
	
	Движения.ДенежныеСредства.Записывать = Истина;
	
	Движение = Движения.ДенежныеСредства.ДобавитьРасход();
	Движение.Период = Дата;
	Движение.Сумма = Сумма;

КонецПроцедуры

Процедура СформироватьДвиженияПоРегиструПланируемыеОстаткиДенежныхСредств()
	
	Движения.ПланируемыеОстаткиДенежныхСредств.Записывать = Истина;
	
	Движение = Движения.ПланируемыеОстаткиДенежныхСредств.Добавить();
	Движение.Период = Дата;
	Движение.Сумма = Сумма;
	
КонецПроцедуры

#КонецОбласти