
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаНачала = ОбщегоНазначенияКлиентСервер.ПолучитьДатуНачалаПериода(ОбщегоНазначенияСервер.ПолучитьИспользуемуюДату());	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаНачалаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	УчетДенежныхСредствКлиент.ОткрытьФормуВыбораДаты(ЭтаФорма, "ДатаНачала", Истина, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЗаписатьЛимит();
	
	ИспользуемаяДата = ОбщегоНазначенийВызовСервера.ПолучитьИспользуемуюДату();
	ДатаНачалаТекущегоПериода = ОбщегоНазначенияКлиентСервер.ПолучитьДатуНачалаПериода(ИспользуемаяДата);
	
	Если ДатаНачалаТекущегоПериода = ДатаНачала Тогда
		Оповестить("ИзменениеЛимитаНаПериод");
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура ЗаписатьЛимит()
	
	МенеджерЗаписи = РегистрыСведений.ЛимитДенежныхСредств.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ДатаНачала;
	МенеджерЗаписи.Сумма = Лимит;
	
	Если Лимит = 0 Тогда
		МенеджерЗаписи.Удалить();
	Иначе
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти