
#Если МобильноеПриложениеКлиент Тогда 

Процедура ПриНачалеРаботыСистемы() Экспорт
	
	Если ВстроенныеПокупки.ПоддерживаютсяПокупки() Тогда
		
		ТипСоединенияСИнтернет = ИнформацияОбИнтернетСоединении.ПолучитьТипСоединения();
		Если ТипСоединенияСИнтернет <> ТипИнтернетСоединения.НетСоединения Тогда
			ВстроенныеПокупки.ОбновитьИнформациюОПриобретении(МассивДоступныхПокупок());	
		КонецЕсли;
		
		СписокПокупок = ВстроенныеПокупки.ПолучитьСписок(МассивДоступныхПокупок(), Ложь);
		
		Если ВстроенныеПокупки.ПоддерживаетсяИсторияПриобретений(ИдентфикаторГлавнойПодписки()) Тогда
			МассивИстории = ВстроенныеПокупки.ПолучитьИсториюПриобретений(ИдентфикаторГлавнойПодписки());
		КонецЕсли;
		
		МассивКвитанций = ВстроенныеПокупки.ПолучитьКвитанцииВстроенныхПокупок(МассивДоступныхПокупок());
		
	КонецЕсли;
	
КонецПроцедуры

Функция МассивДоступныхПокупок() Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(ИдентфикаторГлавнойПодписки());
	
	Возврат Массив;
	
КонецФункции

Функция ИдентфикаторГлавнойПодписки() Экспорт
	
	Возврат "MainSubs";
	
КонецФункции

#КонецЕсли
