
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОтборПоДате") И Параметры.ОтборПоДате Тогда
		УстановитьОтборПоДате();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура УстановитьОтборПоДате()
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		Список.КомпоновщикНастроек.Настройки.Отбор,
		"Дата",
		ВидСравненияКомпоновкиДанных.БольшеИлиРавно,
		ОбщегоНазначенияКлиентСервер.ПолучитьДатуНачалаПериода(ТекущаяДата()),
		,
		Истина);
		
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		Список.КомпоновщикНастроек.Настройки.Отбор,
		"Дата",
		ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,
		ОбщегоНазначенияКлиентСервер.ПолучитьДатуОкончанияПериода(ТекущаяДата()),
		,
		Истина);	
	
КонецПроцедуры

#КонецОбласти