
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОтборПоДате") И Параметры.ОтборПоДате Тогда
		ДатаНачалаПериода = ОбщегоНазначенияКлиентСервер.ПолучитьДатуНачалаПериода(ТекущаяДата());
		ДатаОкончанияПериода = ОбщегоНазначенияКлиентСервер.ПолучитьДатуОкончанияПериода(ТекущаяДата()); 
		УстановитьОтборПоДате();
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("ВидРасхода") Тогда
		Если Параметры.Отбор.ВидРасхода = Перечисления.ВидыРасходов.Планируемый Тогда
			Заголовок = "Планируемые расходы";
		ИначеЕсли Параметры.Отбор.ВидРасхода = Перечисления.ВидыРасходов.Фактический Тогда
			Заголовок = "Фактические расходы";	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СдвинутьПериодНазад(Команда)
	
	ДатаОкончанияПериода = ДатаНачалаПериода - 1;
	ДатаНачалаПериода = ОбщегоНазначенияКлиентСервер.ПолучитьДатуНачалаПериода(ДатаОкончанияПериода);
	УстановитьОтборПоДате();
	
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьПериодВперед(Команда)
	
	ДатаНачалаПериода = ДатаОкончанияПериода + 1;
	ДатаОкончанияПериода = ОбщегоНазначенияКлиентСервер.ПолучитьДатуОкончанияПериода(ДатаНачалаПериода);
	УстановитьОтборПоДате();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура УстановитьОтборПоДате()
	
	Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
	
	ШаблонПредставлениеПериода = "%1 - %2";
	ПредставлениеПериода = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонПредставлениеПериода,
		Формат(ДатаНачалаПериода, "ДЛФ=DD"),
		Формат(ДатаОкончанияПериода, "ДЛФ=DD"));
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		Список.КомпоновщикНастроек.Настройки.Отбор,
		"Дата",
		ВидСравненияКомпоновкиДанных.БольшеИлиРавно,
		ДатаНачалаПериода,
		,
		Истина);
		
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		Список.КомпоновщикНастроек.Настройки.Отбор,
		"Дата",
		ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,
		ДатаОкончанияПериода,
		,
		Истина);	
	
КонецПроцедуры

#КонецОбласти