
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ОтборПоДате") И Параметры.ОтборПоДате Тогда
		ДатаНачалаПериода = ОбщегоНазначенияКлиентСервер.ПолучитьДатуНачалаПериода(ТекущаяДата());
		ДатаОкончанияПериода = ОбщегоНазначенияКлиентСервер.ПолучитьДатуОкончанияПериода(ТекущаяДата()); 
		УстановитьОтборПоДате(Истина);
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("ВидРасхода") Тогда
		Если Параметры.Отбор.ВидРасхода = Перечисления.ВидыРасходов.Планируемый Тогда
			Заголовок = "Планируемые расходы";
		ИначеЕсли Параметры.Отбор.ВидРасхода = Перечисления.ВидыРасходов.Фактический Тогда
			Заголовок = "Фактические расходы";	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СдвинутьПериодНазад(Команда)
	
	ДатаОкончанияПериода = ДатаНачалаПериода - 1;
	ДатаНачалаПериода = ОбщегоНазначенияКлиентСервер.ПолучитьДатуНачалаПериода(ДатаОкончанияПериода);
	УстановитьОтборПоДате(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СдвинутьПериодВперед(Команда)
	
	ДатаНачалаПериода = ДатаОкончанияПериода + 1;
	ДатаОкончанияПериода = ОбщегоНазначенияКлиентСервер.ПолучитьДатуОкончанияПериода(ДатаНачалаПериода);
	УстановитьОтборПоДате(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВесьСписок(Команда)
	
	Элементы.ПоказатьВесьСписок.Пометка = Не Элементы.ПоказатьВесьСписок.Пометка;
	
	УстановитьОтборПоДате(Не Элементы.ПоказатьВесьСписок.Пометка);
	
	Если Элементы.ПоказатьВесьСписок.Пометка Тогда
		Элементы.ПоказатьВесьСписок.Заголовок = "Включить отбор по периоду";
	Иначе
		Элементы.ПоказатьВесьСписок.Заголовок = "Показать весь список";
	КонецЕсли;
	
	Элементы.ОтборПериод.Видимость = Не Элементы.ПоказатьВесьСписок.Пометка;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура УстановитьОтборПоДате(Использовать)
	
	Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
	
	ШаблонПредставлениеПериода = "%1 - %2";
	ПредставлениеПериода = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблонПредставлениеПериода,
		Формат(ДатаНачалаПериода, "ДЛФ=DD"),
		Формат(ДатаОкончанияПериода, "ДЛФ=DD"));
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		Список.КомпоновщикНастроек.Настройки.Отбор,
		"Дата",
		ВидСравненияКомпоновкиДанных.БольшеИлиРавно,
		ДатаНачалаПериода,
		,
		Использовать);
		
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		Список.КомпоновщикНастроек.Настройки.Отбор,
		"Дата",
		ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,
		ДатаОкончанияПериода,
		,
		Использовать);
		
КонецПроцедуры

#КонецОбласти