
Функция ПолучитьДатуНачалаНедели(Дата) Экспорт
	
	ТекущийДень = ДеньНедели(Дата);
	
	Если ТекущийДень = 1 Тогда
		Возврат НачалоДня(Дата);
	Иначе
		КоличествоДней = -1 * (ТекущийДень - 1);
	КонецЕсли;
	
	Возврат НачалоДня(ОбщегоНазначенийВызовСервера.ДобавитьКДате(Дата, КоличествоДней, "ДЕНЬ"));
	
КонецФункции

Функция ПолучитьДатуОкончанияНедели(Дата) Экспорт
	
	ТекущийДень = ДеньНедели(Дата);
	
	Если ТекущийДень = 7 Тогда
		Возврат КонецДня(Дата);
	Иначе
		КоличествоДней = 7 - ТекущийДень;
	КонецЕсли;
	
	Возврат КонецДня(ОбщегоНазначенийВызовСервера.ДобавитьКДате(Дата, КоличествоДней, "ДЕНЬ"));	
	
КонецФункции